# Python for Meteorology, Oceanography, and Climate

## Data Manipulation with Pandas

Pandas is a powerful and widely used Python library for data manipulation and analysis. It provides data structures like DataFrames and Series that make it easy to work with structured data. This exposition focuses on key functionalities of Pandas: reading/writing data, cleaning/preprocessing, exploration/analysis, and filtering/sorting/grouping.

In [63]:
import pandas as pd

### Reading and writing data

In [64]:
df = pd.read_csv('dataset/data.csv')
print(df)

      Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   22     Paris   45000
3    David   35     Tokyo   70000
4      Eve   28       NaN   55000

In [65]:
df.to_csv('dataset/data_copy.csv', index=False)
df.to_excel('dataset/data_copy.xlsx', index=False)

### Data cleaning and preprocessing

In [66]:
df = pd.read_csv('dataset/data.csv')
print("\nOriginal DataFrame:\n", df)

Original DataFrame:
       Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   22     Paris   45000
3    David   35     Tokyo   70000
4      Eve   28       NaN   55000

In [67]:
# Handling Missing Values
df['Age'] = df['Age'].fillna(df['Age'].mean()) #fill NaN age with mean age.
print("\nDataFrame after filling NaN age:\n", df)

DataFrame after filling NaN age:
       Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   22     Paris   45000
3    David   35     Tokyo   70000
4      Eve   28       NaN   55000

In [68]:
# Removing Duplicates (add a duplicate row to the csv to test)
df = df.drop_duplicates()
print("\nDataFrame after dropping duplicates:\n", df)

DataFrame after dropping duplicates:
       Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   22     Paris   45000
3    David   35     Tokyo   70000
4      Eve   28       NaN   55000

In [69]:
# Data Type Conversion
df['Age'] = df['Age'].astype(int)
print("\nDataFrame with Age as integer:\n", df)

DataFrame with Age as integer:
       Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   22     Paris   45000
3    David   35     Tokyo   70000
4      Eve   28       NaN   55000

In [70]:
# String Manipulation
df['City'] = df['City'].str.lower()
print("\nDataFrame with lowercase cities:\n", df)

DataFrame with lowercase cities:
       Name  Age      City  Salary
0    Alice   25  new york   50000
1      Bob   30    london   60000
2  Charlie   22     paris   45000
3    David   35     tokyo   70000
4      Eve   28       NaN   55000

### Data exploration and analysis (statistical summary)

In [71]:
print("\nBasic Information:\n", df.info())
print("\nDescriptive Statistics:\n", df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    4 non-null      object
 3   Salary  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

Basic Information:
 None

Descriptive Statistics:
              Age        Salary
count   5.000000      5.000000
mean   28.000000  56000.000000
std     4.949747   9617.692031
min    22.000000  45000.000000
25%    25.000000  50000.000000
50%    28.000000  55000.000000
75%    30.000000  60000.000000
max    35.000000  70000.000000

In [72]:
# Statistical Functions
print("\nMean Age:", df['Age'].mean())
print("\nMedian Salary:", df['Salary'].median())
print("\nValue Counts of Cities:\n", df['City'].value_counts())
print("\nCorrelation:\n", df.corr(numeric_only=True)) # numeric_only is needed to prevent errors with non-numeric data.

Mean Age: 28.0

Median Salary: 55000.0

Value Counts of Cities:
 City
new york    1
london      1
paris       1
tokyo       1
Name: count, dtype: int64

Correlation:
              Age    Salary
Age     1.000000  0.997791
Salary  0.997791  1.000000

### Data filtering, sorting, and grouping

In [73]:
# Filtering
filtered_df = df[df['Age'] > 25]
print("\nFiltered DataFrame (Age > 25):\n", filtered_df)

filtered_df2 = df[(df['City'] == 'new york') & (df['Salary'] >= 50000)]
print("\nFiltered DataFrame (City New York and Salary >= 50000):\n", filtered_df2)

Filtered DataFrame (Age > 25):
     Name  Age    City  Salary
1    Bob   30  london   60000
3  David   35   tokyo   70000
4    Eve   28     NaN   55000

Filtered DataFrame (City New York and Salary >= 50000):
     Name  Age      City  Salary
0  Alice   25  new york   50000

In [74]:
# Sorting
sorted_df = df.sort_values(by='Age', ascending=False)
print("\nSorted DataFrame (Age descending):\n", sorted_df)

Sorted DataFrame (Age descending):
       Name  Age      City  Salary
3    David   35     tokyo   70000
1      Bob   30    london   60000
4      Eve   28       NaN   55000
0    Alice   25  new york   50000
2  Charlie   22     paris   45000

In [75]:
# Grouping
grouped_df = df.groupby('City')['Salary'].mean()
print("\nAverage Salary by City:\n", grouped_df)

grouped_df2 = df.groupby('City').agg({'Salary': ['mean', 'sum'], 'Age': 'mean'})
print("\nAggregated Data by City:\n", grouped_df2)

Average Salary by City:
 City
london      60000.0
new york    50000.0
paris       45000.0
tokyo       70000.0
Name: Salary, dtype: float64

Aggregated Data by City:
            Salary          Age
             mean    sum  mean
City
london    60000.0  60000  30.0
new york  50000.0  50000  25.0
paris     45000.0  45000  22.0
tokyo     70000.0  70000  35.0

In [76]:
#applying a function to each group.
def top_n(dataframe, column, n=2):
    return dataframe.sort_values(by=column, ascending=False)[:n]

top_salaries = df.groupby('City').apply(top_n, column='Salary', include_groups=False)
print("\nTop 2 Salaries per city:\n", top_salaries)

Top 2 Salaries per city:
                Name  Age  Salary
City
london   1      Bob   30   60000
new york 0    Alice   25   50000
paris    2  Charlie   22   45000
tokyo    3    David   35   70000